Fix pipeline diagram with mermaid
